Revit 2024 API
StructuralSectionLAngle Class
 Defines parameters for L-angle Flange structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class StructuralSectionLAngle : StructuralSectionGeneralW
Visual Basic
Public Class StructuralSectionLAngle _
	Inherits StructuralSectionGeneralW
Visual C++
public ref class StructuralSectionLAngle : public StructuralSectionGeneralW
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle
See Also
StructuralSectionLAngle Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace